import 'dart:async';
import 'package:azkar/model/zekr.dart';
import 'package:azkar/screens/category.dart';
import 'package:path_provider/path_provider.dart';
import 'package:sqflite/sqflite.dart';
import 'package:path/path.dart';

class Db {
  static Db _instance;
  static Db get instance => _instance ?? Db._();
  Db._();
  Database _db;
  final int _version = 1;
  final String _dbName = 'azkar';
  Future<Database> get db async {
    return _db ??
        await openDatabase(
            join(
              (await getApplicationDocumentsDirectory()).path,
              '$_dbName.db',
            ),
            version: _version,
            onCreate: _onCreate,
            onUpgrade: _onUpgrade);
  }

  Future<FutureOr<void>> _onCreate(Database db, int version) async {
    await db.execute(_ZekrInitial._create);
    print('Zekr created');
    if (_ZekrInitial._firstData.isNotEmpty) {
      for (ZekrModel zekr in _ZekrInitial._firstData) {
        await db.insert('Zekr', zekr.toMap);
      }
      print("Zekr Data Inserted");
    }
    print('DataBase Created');
  }

  Future<List<Map<String, dynamic>>> queryTable(String tableName,
      {String where, List<String> columns, bool distinct}) async {
    Database dbQuery = await db;
    return await dbQuery.query('`$tableName`',
        where: where, columns: columns, distinct: distinct);
  }

  insert(String table, Map<String, dynamic> values) async {
    Database dbExec = await db;
    dbExec.insert(table, values);
    List<String> where = [];
    values.forEach(
      (k, v) {
        where.add(" `$k` = '$v' ");
      },
    );
    return dbExec.query(table, where: where.join("and"));
  }

  FutureOr<void> _onUpgrade(Database db, int oldVersion, int newVersion) {
    print('DataBase Upgraded');
  }

  update(String table, Map<String, dynamic> values, String where) async {
    Database dbEx = await db;
    dbEx.update(table, values, where: where);
  }

  delete(String table, String where) async {
    Database dbEx = await db;
    return dbEx.delete(table, where: where);
  }
}

class _ZekrInitial {
  static const String _create = """
  CREATE TABLE `Zekr` (
	`id`	INTEGER PRIMARY KEY AUTOINCREMENT,
	`name`	TEXT NOT NULL,
	`about`	TEXT DEFAULT 'لا يوحد',
	`category`	TEXT DEFAULT '${CategoryNames.Favorite}',
	`target`	INTEGER DEFAULT 0,
	`actually`	INTEGER DEFAULT 0,
  `isFavorite` INTEGER DEFAULT 0
);""";

  static List<ZekrModel> _firstData = [
    //الصباح
    ZekrModel(
        name:
            "ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَ ٱلۡحَیُّ ٱلۡقَیُّومُۚ لَا تَأۡخُذُهُۥ سِنَةࣱ وَلَا نَوۡمࣱۚ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِی یَشۡفَعُ عِندَهُۥۤ إِلَّا بِإِذۡنِهِۦۚ یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا یُحِیطُونَ بِشَیۡءࣲ مِّنۡ عِلۡمِهِ إِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرۡسِیُّهُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَۖ وَلَا یَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "من قالها حين يصبح أجير من الجن حتى يمسي ومن قالها حين يمسي أجير من الجن حتى يصبح. الحاكم وصححه الألباني. "),
    ZekrModel(
        name:
            "قُلۡ هُوَ ٱللَّهُ أَحَدٌ ٱللَّهُ ٱلصَّمَدُلَمۡ یَلِدۡ وَلَمۡ یُولَدۡ وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ",
        target: 3,
        category: CategoryNames.Morning,
        about:
            "قال صلى الله عليه وسلم من قال قل هو الله أحد والموعذتين حين يصبح وحين يمسي ثلاثا تكفيه من كل شئ. "),
    ZekrModel(
        name:
            " قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ مِن شَرِّ مَا خَلَقَ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
        target: 3,
        category: CategoryNames.Morning,
        about:
            "قال صلى الله عليه وسلم من قال قل هو الله أحد والموعذتين حين يصبح وحين يمسي ثلاثا تكفيه من كل شئ. "),
    ZekrModel(
        name:
            "قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ مَلِكِ ٱلنَّاسِ إِلَـٰهِ ٱلنَّاسِ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ الَّذِی یُوَسۡوِسُ فِی صُدُورِ ٱلنَّاسِ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ",
        target: 3,
        category: CategoryNames.Morning,
        about:
            "قال صلى الله عليه وسلم من قال قل هو الله أحد والموعذتين حين يصبح وحين يمسي ثلاثا تكفيه من كل شئ."),
    ZekrModel(
        name:
            "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ  رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا  رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ ",
        target: 1,
        category: CategoryNames.Morning,
        about: "صحيح مسلم."),
    ZekrModel(
        name:
            "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت واليك المصير وإذا أمسي فليقل اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت واليك المصير",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "كان رسول الله صلى الله عليه وسلم يعلم أصحابه يقول :إذا أصبح أحدكم فليقل اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور وإذا أمسي فليقل اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك النشور. "),
    ZekrModel(
        name:
            " اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َخَلَقْتَنِي وَأَنَا عَبْدُكَ  وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ  أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ فَهُوَ مِنْ أَهْلِ الجَنَّةِوَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَافَمَاتَ قَبْلَ أَنْ يُصْبِحَ فَهُوَ مِنْ أَهْلِ الجَنَّةِ. صحيح البخاري"),
    ZekrModel(
        name:
            "اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "روى الإمام أحمد في مسنده والترمذي في سننه وحسنه عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ قَالَ : أَتَيْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ، فَقُلْتُ لَهُ : حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ  فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً فَقَالَ : هَذَا مَا كَتَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ  فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا : أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :  يَا أَبَا بَكْرٍ قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ  عَالِمَ الْغَيْبِ وَالشَّهَادَةِ لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي  وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ  وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ. "),
    ZekrModel(
        name:
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ  وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "روى أبو داود عن ابْن عُمَرَ ،قال : لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ ، حِينَ يُمْسِي ، وَحِينَ يُصْبِحُ :  اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ  اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي  اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ."),
    ZekrModel(
        name:
            "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "روى النسائي في الكبرى عن أَنَس بْن مَالِكٍ قال : قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِفَاطِمَةَ : مَا يَمْنَعُكِ أَنْ تَسْمَعِي مَا أُوصِيكِ بِهِ  أَنْ تَقُولِي إِذَا أَصْبَحْتِ وَإِذَا أَمْسَيْتِ : يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ  وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ ."),
    ZekrModel(
        name:
            " اللهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "روى أبو داود والترمذي والنسائي في الكبرى عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ :  اللهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا "),
    ZekrModel(
        name:
            "أَصْبَحَنا وأصبح الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ  رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا  وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا  رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ  رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
        target: 1,
        category: CategoryNames.Morning,
        about:
            "روى مسلم  عن ابن مسعود قَالَ : كَانَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ  إِذَا أَمْسَى قَالَ :  أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا  رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ  رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ .وَإِذَا أَصْبَحَ قَالَ ذَلِكَ أَيْضًا : أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ. "),
    ZekrModel(
        name:
            "رَضِيتُ بِاللهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ",
        target: 3,
        category: CategoryNames.Morning,
        about:
            "روى أحمد  عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا  إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ. "),
    ZekrModel(
        name:
            "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
        target: 3,
        category: CategoryNames.Morning,
        about:
            "عن عثمان بن عفان رضي الله عنه قال : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : مَنْ قَالَ : بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ. رواه أبو داود. "),
    ZekrModel(
        name:
            "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
        target: 7,
        category: CategoryNames.Morning,
        about:
            "روى أبو داود  عَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُإِلَّا هُوَ ، عَنْهُ ، قَالَ : مَنْ قَالَ إِذَا أَصْبَحَ وَإِذَا أَمْسَى ، حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ سَبْعَ مَرَّاتٍ كَفَاهُ اللَّهُ مَا أَهَمَّهُ."),
    ZekrModel(
        name:
            "سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
        target: 3,
        category: CategoryNames.Morning,
        about:
            "روى مسلم عَنْ جُوَيْرِيَةَ  أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهِيَ فِي مَسْجِدِهَا ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهِيَ جَالِسَةٌ فَقَالَ : مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا ؟ قَالَتْ : نَعَمْ ، قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّات ٍ لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ : سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ."),
    ZekrModel(
        name:
            "اللهُمَّ إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا الله وحدك لا شريك لك وأن محمداً عبدك ورسولك ",
        target: 4,
        category: CategoryNames.Morning,
        about: "من قالها أربع مرات حين يصبح  أعتقه الله من النار. "),
    ZekrModel(
        name:
            "اللهُمَّ ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك فلك الحمد ولك الشكر ",
        target: 1,
        category: CategoryNames.Morning,
        about: " من قالها صباحاً ومساءا فقد أدى شكر يومه. "),
    ZekrModel(
        name:
            "اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا إله إلا أنت اللهم إني أعوذ بك من الكفر والفقر وأعوذ بك من عذاب القبر لا إله إلا أنت ",
        target: 3,
        category: CategoryNames.Morning,
        about: "تقال ثلاث مرات صباحاً ومساءا. "),
    ZekrModel(
        name: "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
        target: 100,
        category: CategoryNames.Morning,
        about:
            "روى مسلم  عَنْ أَبِي هُرَيْرَةَ قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي : سُبْحَانَ اللهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ  لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ  أَوْ زَادَ عَلَيْهِ."),
    ZekrModel(
        name:
            "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ  لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        target: 100,
        category: CategoryNames.Morning,
        about:
            "روى البخاري عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :  مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ  لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، فِي يَوْمٍ مِائَةَ مَرَّةٍ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ  وَكَانَتْ لَهُ حِرْزًا مِنْ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ  وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ  إِلَّا رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ."),

    // المساء
    ZekrModel(
        name:
            "ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَ ٱلۡحَیُّ ٱلۡقَیُّومُۚ لَا تَأۡخُذُهُۥ سِنَةࣱ وَلَا نَوۡمࣱۚ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِی یَشۡفَعُ عِندَهُۥۤ إِلَّا بِإِذۡنِهِۦۚ یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا یُحِیطُونَ بِشَیۡءࣲ مِّنۡ عِلۡمِهِۦۤ إِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرۡسِیُّهُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَۖ وَلَا یَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ",
        target: 1,
        category: CategoryNames.Evening,
        about:
            "من قالها حين يصبح أجير من الجن حتى يمسي ومن قالها حين يمسي أجير من الجن حتى يصبح. الحاكم وصححه الألباني. "),
    ZekrModel(
        name:
            "قُلۡ هُوَ ٱللَّهُ أَحَدٌ ٱللَّهُ ٱلصَّمَدُلَمۡ یَلِدۡ وَلَمۡ یُولَدۡ وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ",
        target: 3,
        category: CategoryNames.Evening,
        about:
            "قال صلى الله عليه وسلم من قال قل هو الله أحد والموعذتين حين يصبح وحين يمسي ثلاثا تكفيه من كل شئ. "),
    ZekrModel(
        name:
            " قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ مِن شَرِّ مَا خَلَقَ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
        target: 3,
        category: CategoryNames.Evening,
        about:
            "قال صلى الله عليه وسلم من قال قل هو الله أحد والموعذتين حين يصبح وحين يمسي ثلاثا تكفيه من كل شئ. "),
    ZekrModel(
        name:
            "قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ مَلِكِ ٱلنَّاسِ إِلَـٰهِ ٱلنَّاسِ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ الَّذِی یُوَسۡوِسُ فِی صُدُورِ ٱلنَّاسِ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ",
        target: 3,
        category: CategoryNames.Evening,
        about:
            "قال صلى الله عليه وسلم من قال قل هو الله أحد والموعذتين حين يصبح وحين يمسي ثلاثا تكفيه من كل شئ."),
    ZekrModel(
        name:
            "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ  رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا  رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ ",
        target: 1,
        category: CategoryNames.Evening,
        about: "صحيح مسلم."),
    ZekrModel(
        name:
            " اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َخَلَقْتَنِي وَأَنَا عَبْدُكَ  وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ  أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
        target: 1,
        category: CategoryNames.Evening,
        about:
            "مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ فَهُوَ مِنْ أَهْلِ الجَنَّةِوَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَافَمَاتَ قَبْلَ أَنْ يُصْبِحَ فَهُوَ مِنْ أَهْلِ الجَنَّةِ. صحيح البخاري"),
    ZekrModel(
        name:
            "اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ لا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي  وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
        target: 1,
        category: CategoryNames.Evening,
        about:
            "روى الإمام أحمد في مسنده والترمذي في سننه وحسنه عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ قَالَ : أَتَيْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ فَقُلْتُ لَهُ : حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ  فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً فَقَالَ : هَذَا مَا كَتَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ  فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا : أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :  يَا أَبَا بَكْرٍ قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ  عَالِمَ الْغَيْبِ وَالشَّهَادَةِ لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي  وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ  وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ. "),
    ZekrModel(
        name:
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ  وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
        target: 3,
        category: CategoryNames.Evening,
        about:
            "روى أبو داود عن ابْن عُمَرَ ،قال : لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ ، حِينَ يُمْسِي وَحِينَ يُصْبِحُ :  اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ  اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي  اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ."),
    ZekrModel(
        name:
            "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
        target: 1,
        category: CategoryNames.Evening,
        about:
            "روى النسائي في الكبرى عن أَنَس بْن مَالِكٍ قال : قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِفَاطِمَةَ : مَا يَمْنَعُكِ أَنْ تَسْمَعِي مَا أُوصِيكِ بِهِ  أَنْ تَقُولِي إِذَا أَصْبَحْتِ وَإِذَا أَمْسَيْتِ : يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ  وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ ."),
    ZekrModel(
        name:
            " اللهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَاوَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
        target: 1,
        category: CategoryNames.Evening,
        about:
            "روى أبو داود والترمذي والنسائي في الكبرى عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ :  اللهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا "),
    ZekrModel(
        name:
            "أَمسينا وأمسى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ  رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا  وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا  رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ  رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
        target: 1,
        category: CategoryNames.Evening,
        about:
            "روى مسلم  عن ابن مسعود قَالَ : كَانَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ  إِذَا أَمْسَى قَالَ :  أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا  رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ  رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ .وَإِذَا أَصْبَحَ قَالَ ذَلِكَ أَيْضًا : أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ. "),
    ZekrModel(
        name:
            "رَضِيتُ بِاللهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ",
        target: 3,
        category: CategoryNames.Evening,
        about:
            "روى أحمد  عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا  إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ. "),
    ZekrModel(
        name:
            "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
        target: 3,
        category: CategoryNames.Evening,
        about:
            "عن عثمان بن عفان رضي الله عنه قال : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : مَنْ قَالَ : بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ. رواه أبو داود. "),
    ZekrModel(
        name:
            "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
        target: 7,
        category: CategoryNames.Evening,
        about:
            "روى أبو داود  عَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُإِلَّا هُوَ ، عَنْهُ ، قَالَ : مَنْ قَالَ إِذَا أَصْبَحَ وَإِذَا أَمْسَى ، حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ سَبْعَ مَرَّاتٍ كَفَاهُ اللَّهُ مَا أَهَمَّهُ."),
    ZekrModel(
        name:
            "سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
        target: 3,
        category: CategoryNames.Evening,
        about:
            "روى مسلم عَنْ جُوَيْرِيَةَ  أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهِيَ فِي مَسْجِدِهَا ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهِيَ جَالِسَةٌ فَقَالَ : مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا ؟ قَالَتْ : نَعَمْ ، قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّات ٍ لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ : سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ."),
    ZekrModel(
        name:
            "اللهُمَّ إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا الله وحدك لا شريك لك وأن محمداً عبدك ورسولك ",
        target: 4,
        category: CategoryNames.Evening,
        about: "من قالها أربع مرات حين يصبح  أعتقه الله من النار. "),
    ZekrModel(
        name:
            "اللهُمَّ ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك فلك الحمد ولك الشكر ",
        target: 1,
        category: CategoryNames.Evening,
        about: " من قالها صباحاً ومساءا فقد أدى شكر يومه. "),
    ZekrModel(
        name:
            "اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا إله إلا أنت اللهم إني أعوذ بك من الكفر والفقر وأعوذ بك من عذاب القبر لا إله إلا أنت ",
        target: 3,
        category: CategoryNames.Evening,
        about: "تقال ثلاث مرات صباحاً ومساءا. "),
    ZekrModel(
        name: "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
        target: 100,
        category: CategoryNames.Evening,
        about:
            "روى مسلم  عَنْ أَبِي هُرَيْرَةَ قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي : سُبْحَانَ اللهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ  لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ  أَوْ زَادَ عَلَيْهِ."),
    ZekrModel(
        name:
            "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ  لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        target: 100,
        category: CategoryNames.Evening,
        about:
            "روى البخاري عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :  مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ  لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، فِي يَوْمٍ مِائَةَ مَرَّةٍ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ  وَكَانَتْ لَهُ حِرْزًا مِنْ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ  وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ  إِلَّا رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ."),

    // الصلاة
    ZekrModel(
        category: CategoryNames.Pray,
        name: 'أستغفر الله العظيم ',
        target: 3,
        about:
            'روى مسلم في الصحيح عن ثوبان قال: كان النبي ﷺ إذا سلم يستغفر ثلاثاً يعني: يقول: أستغفر الله، أستغفر الله، أستغفر الله ثم يقول: اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name: 'اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام',
        target: 1,
        about:
            'روى مسلم في الصحيح عن ثوبان قال: كان النبي ﷺ إذا سلم يستغفر ثلاثاً يعني: يقول: أستغفر الله، أستغفر الله، أستغفر الله ثم يقول: اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name: 'اللهم أعني على ذكرك وشكرك وحسن عبادتك',
        target: 1,
        about:
            'عن معاذ بن جبل رضي الله عنه قال أن النبي ﷺ قال له أوصيك يا معاذ لا تدعن في دبر كل صلاة أن تقول :اللهم أعني على ذكرك وشكرك وحسن عبادتك.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، لا حول ولا قوة إلا بالله، لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن، لا إله إلا الله مخلصين له الدين ولو كره الكافرون',
        target: 1,
        about:
            'رواه مسلم في صحيحه من حديث عبد الله بن الزبير رضي الله عنهما عن النبي ﷺ أنه كان يفعل هذا بعد كل صلاة عليه الصلاة السلام إذا أقبل على الناس.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد',
        target: 1,
        about:
            'زاد المغيرة في روايته كما في الصحيحين عنه أن النبي ﷺ كان يقول: اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name: 'رب قني عذابك يوم تبعث عبادتك',
        target: 1,
        about:
            'عن البراء بن عازب رضي الله عنه قال : كنا إذا صلينا خلف رسول الله ﷺ أحببنا أن نكون عن يمينه يقبل علينا بوجهه فسمعته يقول :رب قني عذابك يوم تبعث عبادك.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَ ٱلۡحَیُّ ٱلۡقَیُّومُۚ لَا تَأۡخُذُهُۥ سِنَةࣱ وَلَا نَوۡمࣱۚ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِی یَشۡفَعُ عِندَهُۥۤ إِلَّا بِإِذۡنِهِۦۚ یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا یُحِیطُونَ بِشَیۡءࣲ مِّنۡ عِلۡمِهِۦۤ إِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرۡسِیُّهُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَۖ وَلَا یَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ',
        target: 1,
        about:
            'قال ﷺ من قرأ آية الكرسي في دبر كل صلاة مكتوبة لم يمنعه من دخول الجنة إلا أن يموت.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'قُلۡ هُوَ ٱللَّهُ أَحَدٌ ٱللَّهُ ٱلصَّمَدُلَمۡ یَلِدۡ وَلَمۡ یُولَدۡ وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ',
        target: 1,
        about:
            'قال عقبة بن نافع رضي الله عنه أمرني رسول الله ﷺ أن أقرأ بالموعذات دبر كل صلاة.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ مِن شَرِّ مَا خَلَقَ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ',
        target: 1,
        about:
            'قال عقبة بن نافع رضي الله عنه أمرني رسول الله ﷺ أن أقرأ بالموعذات دبر كل صلاة.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ مَلِكِ ٱلنَّاسِ إِلَـٰهِ ٱلنَّاسِ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ الَّذِی یُوَسۡوِسُ فِی صُدُورِ ٱلنَّاسِ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ',
        target: 1,
        about:
            'قال عقبة بن نافع رضي الله عنه أمرني رسول الله ﷺ أن أقرأ بالموعذات دبر كل صلاة.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name: 'سبحان الله',
        target: 33,
        about:
            ' قال رسول الله ﷺ  من سبح الله دبر كل صلاة ثلاثاً وثلاثين، وحمد الله ثلاثاً وثلاثين، وكبر الله ثلاثاً وثلاثين، فتلك تسع وتسعون، ثم قال تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، غفرت خطاياه وإن كانت مثل زبد البحر وهذا فضل عظيم.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name: 'الحمد لله',
        target: 33,
        about:
            'قال رسول الله ﷺ  من سبح الله دبر كل صلاة ثلاثاً وثلاثين، وحمد الله ثلاثاً وثلاثين، وكبر الله ثلاثاً وثلاثين، فتلك تسع وتسعون، ثم قال تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، غفرت خطاياه وإن كانت مثل زبد البحر وهذا فضل عظيم.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name: 'الله أكبر',
        target: 33,
        about:
            'قال رسول الله ﷺ  من سبح الله دبر كل صلاة ثلاثاً وثلاثين، وحمد الله ثلاثاً وثلاثين، وكبر الله ثلاثاً وثلاثين، فتلك تسع وتسعون، ثم قال تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، غفرت خطاياه وإن كانت مثل زبد البحر وهذا فضل عظيم.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'لا إله إلا الله وحده لاشريك له، له الملك وله الحمد وهو على كل شيء قدير',
        target: 1,
        about:
            'قال رسول الله ﷺ  من سبح الله دبر كل صلاة ثلاثاً وثلاثين، وحمد الله ثلاثاً وثلاثين، وكبر الله ثلاثاً وثلاثين، فتلك تسع وتسعون، ثم قال تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، غفرت خطاياه وإن كانت مثل زبد البحر وهذا فضل عظيم.'),
    ZekrModel(
        category: CategoryNames.Pray,
        name:
            'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير ',
        target: 10,
        about: 'كان النبي ﷺ يقولها بعد صلاة المغرب والفجر عشر مرات.'),

    // النوم
    ZekrModel(
        category: CategoryNames.Sleep,
        name:
            'باسمك ربي وضعت جنبي وبك أرفعه  إن أمسكت نفسي فارحمها وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين',
        target: 1,
        about:
            'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَنْفُضْ فِرَاشَهُ بِدَاخِلَةِ إِزَارِهِ فَإِنَّهُ لَا يَدْرِي مَا خَلَفَهُ عَلَيْهِ ثُمَّ يَقُولُ : بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ  إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ.'),
    ZekrModel(
        category: CategoryNames.Sleep,
        name: 'باسمك اللهم أموت وأحيا',
        target: 1,
        about:
            'عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ رضي الله عنه قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنَامَ قَالَ بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا وَإِذَا اسْتَيْقَظَ مِنْ مَنَامِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ.'),
    ZekrModel(
        category: CategoryNames.Sleep,
        name:
            'اللهم إني أسلمت نفسي إليك ووجهت وجهي إليك  وفوضت أمري إليك وألجأت ظهري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت ونبيك الذي أرسلت',
        target: 1,
        about:
            'عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِذَا أَتَيْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ ، ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الْأَيْمَنِ ، ثُمَّ قُلْ : اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ : وَفَوَّضْتُ أَمْرِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ  رَغْبَةً وَرَهْبَةً إِلَيْكَ لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ  وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ فَإِنْ مُتَّ مِنْ لَيْلَتِكَ فَأَنْتَ عَلَى الْفِطْرَةِ  وَاجْعَلْهُنَّ آخِرَ مَا تَتَكَلَّمُ بِهِ قَالَ : فَرَدَّدْتُهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَلَمَّا بَلَغْتُ : اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ قُلْتُ : وَرَسُولِكَ قَالَ  لَا وَنَبِيِّكَ الَّذِي أَرْسَلْتَ.'),
    ZekrModel(
        category: CategoryNames.Sleep,
        name:
            'الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا فكم ممن لا كافي له ولا مؤوي',
        target: 1,
        about:
            'عَنْ أَنَسٍ رضي الله عنه أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ :الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ. '),
    ZekrModel(
        category: CategoryNames.Sleep,
        name: 'اللهم قني عذابك يوم تبعث عبادك',
        target: 3,
        about:
            'عَنْ حَفْصَةَ رضي الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَرَادَ أَنْ يَرْقُدَ وَضَعَ يَدَهُ الْيُمْنَى تَحْتَ خَدِّهِ ثُمَّ يَقُولُ : اللَّهُمَّ قِنِى عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ. ثَلاَثَ مِرَارٍ .'),
    ZekrModel(
        category: CategoryNames.Sleep,
        name:
            'اللهم رب السماوات ورب الأرض ورب العرش العظيم ربنا ورب كل شيء  فالق الحب والنوى ومنزل التوراة والإنجيل والفرقان أعوذ بك من شر كل دابة أنت آخذ بناصيتها اللهم أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عنا الدين وأغننا من الفقر',
        target: 1,
        about:
            'عن سهيل قال : كَانَ أَبُو صَالِحٍ يَأْمُرُنَا إِذَا أَرَادَ أَحَدُنَا أَنْ يَنَامَ  أَنْ يَضْطَجِعَ عَلَى شِقِّهِ الْأَيْمَنِ ثُمَّ يَقُولُ : اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ  رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ  اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنْ الْفَقْرِ. '),
    ZekrModel(
        category: CategoryNames.Sleep,
        name:
            'اللهم إني أعوذ بوجهك الكريم وكلماتك التامة من شر ما أنت آخذ بناصيته اللهم أنت تكشف المغرم والمأثم اللهم لا يهزم جندك  ولا يخلف وعدك  ولا ينفع ذا الجد منك الجد سبحانك وبحمدك ',
        target: 1,
        about:
            'عَنْ عَلِيٍّ رضي الله عنه عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ عِنْدَ مَضْجَعِهِ:اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ ، اللَّهُمَّ لَا يُهْزَمُ جُنْدُكَ  وَلَا يُخْلَفُ وَعْدُكَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ سُبْحَانَكَ وَبِحَمْدِكَ. '),
    ZekrModel(
        category: CategoryNames.Sleep,
        name:
            'بسم الله وضعت جنبي اللهم اغفر لي ذنبي وأخسئ شيطاني وفك رهاني واجعلني في الندي الأعلى أي في الملأ الأعلى من الملائكة',
        target: 1,
        about:
            'عَنْ أَبِي الْأَزْهَرِ الْأَنْمَارِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَخَذَ مَضْجَعَهُ مِنْ اللَّيْلِ قَالَ :بِسْمِ اللَّهِ وَضَعْتُ جَنْبِي اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَأَخْسِئْ شَيْطَانِي وَفُكَّ رِهَانِي وَاجْعَلْنِي فِي النَّدِيِّ الْأَعْلَى. '),
    ZekrModel(
        category: CategoryNames.Sleep,
        name:
            ' ءَامَنَ ٱلرَّسُولُ بِمَاۤ أُنزِلَ إِلَیۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰۤىِٕكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَیۡنَ أَحَدࣲ مِّن رُّسُلِهِۦۚ وَقَالُوا۟ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَیۡكَ ٱلۡمَصِیرُ ؛؛؛ لَا یُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَیۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَاۤ إِن نَّسِینَاۤ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَیۡنَاۤ إِصۡرࣰا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِینَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۤۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَـٰفِرِینَ',
        target: 1,
        about:
            'عَنْ أَبِي مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :'),

    // المسلم
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'الصلاة والسلام على النبي',
        target: 0,
        about: ' قال ﷺ من صلى علي صلاة صلى الله عليه بها عشرا.'),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'أستغفر الله العظيم وأتوب إليه',
        target: 0,
        about: 'كان ﷺ يستغفر في اليوم أكثر من سبعين مرة وفي رواية مائة مرة.'),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'لا حول ولا قوة الا بالله العلي العظيم',
        target: 0,
        about: 'كنز من كنوز الجنة.'),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'بسم الله ولجنا وبسم الله خرجنا وعلى الله ربنا توكلنا',
        target: 1,
        about: 'دعاء دخول المنزل.'),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'بسم الله توكلت على الله ولا حول ولا قوة إلا بالله',
        target: 1,
        about: 'دعاء الخروج من المنزل.'),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'بسم الله',
        target: 1,
        about: 'دعاء قبل تناول الطعام.'),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'الحمد لله الذي أطعمني هذا ورزقني�� من غير حول لي ولا قوة',
        target: 1,
        about: 'دعاء الفراغ من الطعام. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'بسم الله أعوذ بالله من الخبث والخبائث',
        target: 1,
        about: ' دعاء عند دخول الخلاء. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: ' غفرانك',
        target: 1,
        about: 'دعاء عند الخروج من الخلاء. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'الحمد الله الذي كساني هذا ورزقنيه من غير حول لي ولا قوة',
        target: 1,
        about: 'دعاء لبس الثوب. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'سبحانك اللهم وبحمدك أشهد أن لا إله إلا الله أستغفرك وأتوب إليك',
        target: 1,
        about: 'دعاء كفارة المجلس. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'بسم اللهم أموت وأحيا ',
        target: 1,
        about: 'دعاء قبل النوم. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور',
        target: 1,
        about: 'دعاء عند الاستيقاظ. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name:
            'الحمد لله الذي عافني مما ابتلاك به وفضلني على كثير ممن خلقت تفضيلا',
        target: 1,
        about: ' دعاء عن زيارة مبتلى أو مصاب. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: ' لا بأس طهور إن شاء الله',
        target: 1,
        about: 'دعاء زيارة المريض. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name:
            'بسم الله والحمد لله سبحان الله الذي سخر لنا هذا وما كنا له مقرنين ',
        target: 1,
        about: 'دعاء الركوب. '),
    ZekrModel(
        category: CategoryNames.Muslim,
        name: 'اللهم لا سهلاً إلا ما جعلته سهلاً وأنت تجعل الحزن إذا شئت سهلاً',
        target: 1,
        about: ' دعاء عند المذاكرة.'),
  ];
}
